src_oh_of41/cavityB0102/0/Ci8
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ci8;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];
//it is a measure of the total quantity of oxygen required to oxidize all organic material into carbon dioxide and water
//from file "devwtrplan_b.pdf" mac
internalField   uniform 9;

boundaryField
{
    movingWall
    {
        type            zeroGradient;
        //type            symmetryPlane;
    }

    fixedWalls
    {
        type            zeroGradient;
        //type            symmetryPlane;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
